export const DONORS_LIST = [
    "강윤정", "김준호", "박상민", "박영애", "박정탁", "안지선", "안지율", "안현진", "오상석", "오승하", "오승현", "원유정", "윤혜영", "이광복", "이광진", "이다예", "이동현", "이윤준", "이윤한", "이주예", "이형주", "임성호", "정미경", "지하연", "최동호", "최아란", "황세영", "홍윤희"
].sort((a, b) => a.localeCompare(b, 'ko'));

export const FINANCE_TYPES = {
    GENERAL: '일반재정',
    SPECIAL: '특별재정'
};

export const INCOME_CATEGORIES = {
    '특별재정': [
        "특별이월금",
        "씨앗헌금(특별)",
        "선교헌금",
        "지정헌금"
    ],
    '일반재정': [
        "일반이월금",
        "감사헌금",
        "기타헌금",
        "잡수익",
        "기타수입"
    ]
};

export const EXPENSE_CATEGORIES = {
    '특별재정': [
        "라온트리지원(월세/관리)",
        "후원(교역자회/명절/공존)",
        "선교사후원",
        "선교비",
        "선교회/성경학교/수련회",
        "출산/병원비/축하",
        "선교사/목회자 식사대접",
        "교회운영/인건비지원",
        "지역봉사/지방회지원",
        "신학생지원",
        "교역자회비/단기선교",
        "라온트리 사역"
    ],
    '일반재정': [
        "퇴직적립금(후원금)",
        "교제비(식대/간식)",
        "서무비",
        "교육비",
        "행사비",
        "비품비",
        "경조비",
        "강사비",
        "상회비(지방회/총회)",
        "접대비",
        "심방비",
        "목회비",
        "목회자사례비",
        "예비비"
    ]
};

export const VIEW_MODES = {
    DAILY: 'DAILY',
    WEEKLY: 'WEEKLY',
    MONTHLY: 'MONTHLY',
    YEARLY: 'YEARLY'
};
